{
    "header":{
        "navElements":[
            {
                "name":"Home",
                "route":"home"
            },
            {
                "name":"About",
                "route":"about"
            },
            {
                "name":"Portfolio",
                "route":"portfolio"
            },
            {
                "name":"Service",
                "route":"service"
            },
            {
                "name":"Contact",
                "route":"contact"
            },
            {
                "name":"Blog",
                "route":"blog"
            }
            
        ],
        "download":{
            "name":"Download CV",
            "route":"contact"
        }
    },
    "home":{
        "hello":"Hello I'm",
        "name":["Vikas","Tiwari"],
        "job":"Web Developer from India",
        "desc":"I will simplify the complexity for you but remember, Nine people can't make a baby in a month.",
        "button":"Get a Quote"
    },
    "features":{
        "title":"Portfolio",
        "heading":"Our Commitment",
        "desc":"We believe that success is not just about hard work; it's about",
        "list":[
            {
                "index":"01",
                "name":"Dedication",
                "desc":"With dedication as our cornerstone, we stand by your side, tirelessly turning your dreams into reality.",
                "src":""
            },
            {
                "index":"02",
                "name":"Smart Work",
                "desc":"We prioritize working smart, by emphasizing efficiency, innovation, and problem-solving to maximize results.",
                "src":""
            },
            {
                "index":"03",
                "name":"Intelligence",
                "desc":"Intelligence is at the core of everything we do. We value knowledge, insights, and data-driven decision-making.",
                "src":""
            }
        ]
    },
    "about":{},
    "services":{},
    "portfolio":{},
    "experience":{},
    "testimonial":{
        "thumb_37x45": "37-45.jpg",
        "title":"Testimonials",
        "heading":"What My Clients Say",
        "desc":"Most common methods for designing websites that work well on desktop is responsive and adaptive design",
        "clientImage":[
            {"src":"c1.jpg","alt":"client profile data"},
            {"src":"c1.jpg","alt":"client profile data"},
            {"src":"c1.jpg","alt":"client profile data"},
            {"src":"c1.jpg","alt":"client profile data"}
        ],
        "clientName":[
            {"name":"James Cameron"},
            {"name":"Alan Walker"},
            {"name":"David Parker"},
            {"name":"Anna Barbera"}
        ],
        "clientJob":[
            {"job":"Aroa Founder"},
            {"job":"Singer"},
            {"job":"Senior Designer"},
            {"job":"Vivaco Group"}
        ],
        "clientMessage":[
            {"message":"Loved the template design and customer support from Marketify team! I am a noob in programming with very little knowledge about coding but the Marketify team helped me to launch my resume website from editing to uploading the template successfully."},
            {"message":"Minimal design, incredibly well documented, and an absolute pleasure to use! The customer support is one of the absolute best I've ever had the pleasure of interacting with. Quick, courteous, and extremely helpful! I can recommend this to anyone."},
            {"message":"Wonderful support. Immediate response and they return with an easy fix and clear information. Applied the fix and it worked like a charm. You can definately trust this producer. Overall great quality service and code. Thanks a lot Marketify team!"},
            {"message":"Super easy to update in a code editor. All the code is labeled with comments and laid out nicely. The documentation is great and the support via live chat was perfect. They helped me out super quick when I had a minor code customization."}
        ]
    },
    "blog":{},
    "subscirbe":{},
    "contact":{},
    "footer":{}
}