{
    "heading":"PROjects",
    "desc":"Quality means doing it right when no one is looking.",
    "projectPageData": [
        {
            "title":"Collabora Draw",
            "category":"Angular, Socket Server",
            "url":"/",
            "src":"preview_draw.png",
            "alt":"project preview img",
            "popup":{
                "title":"CollaboraDraw - Real-time Collaborative Drawing App with Socket Server",
                "subtitle":"Github Link",
                "url":"https://github.com/vikkastiwari/CollaboraDraw",
                "desc":[
                    "Tech Stack - Angular, Ts, Socket Server, HTML, CSS",
                    "CollaboraDraw is an innovative drawing application that takes creativity to the next level by enabling real-time collaboration among multiple users. ",
                    "Built using ElectronJS and powered by a robust Socket Server, this project brings artists, designers, and creative minds together in a shared digital canvas."
                ],
                "src":"draw.png",
                "alt":"project preview img"
            }
        },
        {
            "title":"EList Generator",
            "category":"React",
            "url":"/",
            "src":"preview_el.png",
            "alt":"project preview img",
            "popup":{
                "title":"Elist Generator - Dynamic list generator",
                "subtitle":"Github Link",
                "url":"https://github.com/vikkastiwari/EList-Generator",
                "desc":[
                    "Tech Stack - React, Firebase, Data table, Jsx, Css",
                    "The Elist Generator is a dynamic list generator project created using React, a popular JavaScript library for building user interfaces. The project's tech stack includes React for the frontend, allowing for the creation of a responsive and interactive user interface.",
                    "The Elist Generator enables users to easily generate and manage dynamic lists, enhancing efficiency and organization. With its sleek design and user-friendly interface, this project showcases the power of React in delivering a seamless and intuitive experience for users dealing with dynamic lists."
                ],
                "src":"elistgen.png",
                "alt":"project preview img"
            }
        },
        {
            "title":"Socket Server",
            "category":"Express, Socket.io",
            "url":"/",
            "src":"preview_scoket.png",
            "alt":"project preview img",
            "popup":{
                "title":"CollaboraDraw Socket Server",
                "subtitle":"Github Link",
                "url":"https://github.com/vikkastiwari/socket-server",
                "desc":[
                    "Tech Stack - Express, Javascript, Socket.io",
                    "Experience the thrill of creating art with others simultaneously. CollaboraDraw allows multiple users to draw, sketch, and design together in real time, breaking down geographical barriers.",
                    "The underlying Socket Server technology ensures instant communication between users, updating the canvas in real time. This dynamic connection allows for a smooth collaborative drawing experience, with changes reflected instantaneously for all participants."                ],
                "src":"socket_server.png",
                "alt":"project preview img"
            }
        },
        {
            "title":"Recipe App",
            "category":"Angular",
            "url":"/",
            "src":"preview_recipe.png",
            "alt":"project preview img",
            "popup":{
                "title":"Recipe App",
                "subtitle":"Github Link",
                "url":"https://github.com/vikkastiwari/angular-projects/tree/main/RECIPE",
                "desc":[
                    "Tech Stack - Angular 14, RXJS, Typescript, Html, Css",
                    "The Recipe Application is a modern and efficient project developed using Angular and Ngrx, showcasing a robust tech stack.",
                    "This project focuses on managing recipes and incorporates authentication for a secure user experience. Users can create accounts, log in securely, and enjoy personalized features. ",
                    "Angular's component-based architecture facilitates a modular and organized codebase, while Ngrx efficiently manages the application state, ensuring smooth data flow and consistent user interactions."
                ],
                "src":"recipe.png",
                "alt":"project preview img"
            }
        },
        {
            "title":"Web Scrapper",
            "category":"Electron Js, Puppeteer",
            "url":"/",
            "src":"preview_webs.png",
            "alt":"project preview img",
            "popup":{
                "title":"Web Scrapper",
                "subtitle":"Github Link",
                "url":"https://github.com/vikkastiwari/web-scrapper",
                "desc":[
                    "Tech Stack - Express, Javascript, Socket.io",
                    "The Dynamic Data Aggregator is a powerful web application crafted with Electron.js and Puppeteer, designed to effortlessly scrape and compile real-time data from the web. ",
                    "Using Puppeteer, a headless browser automation tool, the Dynamic Data Aggregator navigates through websites, mimicking user interactions to gather dynamic content such as live prices, stock updates, or real-time news."
                ],
                "src":"webscrapper.png",
                "alt":"project preview img"
            }
        },
        {
            "title":"Omnifood",
            "category":"Html5 & Css3",
            "url":"/",
            "src":"preview_om.png",
            "alt":"project preview img",
            "popup":{
                "title":"Omnifood - Food business landing page",
                "subtitle":"Github Link",
                "url":"https://github.com/vikkastiwari/HTML-CSS/blob/master/omnifood/index.html",
                "desc":[
                    "Tech Stack - HTML5, CSS3 ",
                    "Omni Food, a cutting-edge food business landing page, showcases a seamless blend of technology and design with its robust tech stack. Built using HTML5 and CSS3, the project delivers a visually stunning and responsive user interface. ",
                    "The use of HTML5 ensures a dynamic and interactive user experience, while CSS3 enhances the aesthetics, ensuring a modern and engaging design. Omni Food's tech stack not only provides a visually appealing landing page for the food business but also ensures a smooth and enjoyable browsing experience for users."
                ],
                "src":"omnifood.png",
                "alt":"project preview img"
            }
        },
        {
            "title":"MediHub V2",
            "category":"Express Js",
            "url":"/",
            "src":"preview_medihub.png",
            "alt":"project preview img",
            "popup":{
                "title":"MediHub V2 - Medical logistics hub",
                "subtitle":"Github Link",
                "url":"https://github.com/vikkastiwari/medihub.v2",
                "desc":[
                    "Tech Stack - Express Js, HTML5, CSS3 ",
                    "MedLogistics Hub is a cutting-edge web application developed with Express.js, designed to streamline and optimize the coordination of medical pickups and deliveries within local healthcare ecosystems.",
                    "It contains medical user end portal, consumer user end portal, authentication module, sendgrid mailing service and more.",
                    "This innovative platform serves as a central hub, connecting medical facilities and end-users to efficiently manage the transportation of crucial medical supplies, samples, and equipment."
                ],
                "src":"preview_medihub.png",
                "alt":"project preview img"
            }
        },
        {
            "title":"Burger Builder",
            "category":"React",
            "url":"/",
            "src":"preview_burger.png",
            "alt":"project preview img",
            "popup":{
                "title":"Burger Builder - Build your delicious burger",
                "subtitle":"Github Link",
                "url":"https://github.com/vikkastiwari/burger-builder",
                "desc":[
                    "Tech Stack - React, Firebase, Jsx, Css",
                    "A dynamic web application that puts the power of burger creation in the hands of users! Say goodbye to fixed menus and hello to a customizable culinary experience. ",
                    "Once the perfect burger is crafted, users can seamlessly proceed to the ordering process. The application provides a streamlined checkout experience, allowing users to review and place their order."
                ],
                "src":"burger_builder.png",
                "alt":"project preview img"
            }
        },
        {
            "title":"Shopit ecommerece",
            "category":"Angular",
            "url":"/",
            "src":"preview_shop.png",
            "alt":"project preview img",
            "popup":{
                "title":"Shopit - Shop now",
                "subtitle":"Github Link",
                "url":"https://github.com/vikkastiwari",
                "desc":[
                    "Tech Stack - Angular 14, RXJS, Typescript, Html, Css",
                    "The ecommerce application is built on a robust tech stack centered around Angular, a powerful front-end framework.",
                    "Angular provides a seamless and dynamic user interface, ensuring a smooth and responsive shopping experience. The application leverages TypeScript for efficient development and enhanced code quality.",
                    "The responsive design ensures a consistent and engaging experience across various devices, including desktops, tablets, and smartphones."
                ],
                "src":"preview_shop.png",
                "alt":"project preview img"
            }
        },
        {
            "title":"Investment Calculator",
            "category":"React",
            "url":"/",
            "src":"preview_invest.png",
            "alt":"project preview img",
            "popup":{
                "title":"Investment Calculator",
                "subtitle":"Github Link",
                "url":"https://github.com/vikkastiwari/exploring-react/tree/main/investment%20calculator",
                "desc":[
                    "Tech Stack - React, Jsx, Css",
                    "The project focuses on investment calculation, providing users with a streamlined platform to assess and analyze their investment portfolios.",
                    "With a responsive design and real-time updates, users can make informed decisions and monitor their investments with ease.",
                    "The responsive design ensures a consistent and engaging experience across various devices, including desktops, tablets, and smartphones."
                ],
                "src":"expense.png",
                "alt":"project preview img"
            }
        },
        {
            "title":"Task Manager",
            "category":"React, Nest",
            "url":"/",
            "src":"preview_task_manager.png",
            "alt":"project preview img",
            "popup":{
                "title":"Task Manager App",
                "subtitle":"Github Link",
                "url":"https://github.com/vikkastiwari/Task-Manager",
                "desc":[
                    "Tech Stack - React, Nest, Typescript",
                    "Introducing our cutting-edge project, a robust Task Manager built on the powerful NestJS framework with a seamlessly integrated authentication module. This project offers an efficient and secure solution for managing tasks within your organization or personal projects.",
                    "Effortlessly organize and track tasks with our intuitive task management system. Enjoy features such as task creation, editing, and completion, ensuring a streamlined workflow for your projects.",
                    "Prioritize security with our seamlessly integrated authentication module. Safeguard your task management system by implementing robust user authentication mechanisms, including secure password storage and token-based authentication."
                ],
                "src":"task_manager.png",
                "alt":"project preview img"
            }
        },
        {
            "title":"AmZone",
            "category":"React",
            "url":"/",
            "src":"preview_amzone.png",
            "alt":"project preview img",
            "popup":{
                "title":"Amzone - Amazon Clone",
                "subtitle":"Github Link",
                "url":"https://github.com/vikkastiwari/amazon-clone",
                "desc":[
                    "Tech Stack - React, Jsx, Css",
                    "The Amazon Clone application is built using a robust tech stack centered around React and Google Authentication.",
                    "This project's tech stack combines the flexibility of React with the authentication reliability of Google, resulting in a smooth and trustworthy user experience. The application replicates key features of the Amazon platform, providing a familiar and user-friendly environment for online shopping."
                ],
                "src":"amazon.png",
                "alt":"project preview img"
            }
        }
    ]
}